/**
 * 华夏银行全国分行分布数据
 */
export const branchPoints = [
  {
    name: '华东区域',
    center: [121.473701, 31.230416],
    children: [
      {
        name: '常州分行',
        center: [119.974061, 31.810689]
      },
      {
        name: '上海分行',
        center: [121.473701, 31.230416]
      },
      {
        name: '苏州分行',
        center: [120.619585, 31.317987]
      },
      {
        name: '杭州分行',
        center: [120.219375, 30.259244]
      },
      {
        name: '合肥分行',
        center: [117.282699, 31.866942]
      },
      {
        name: '无锡分行',
        center: [120.31191, 31.491169]
      },
      {
        name: '济南分行',
        center: [117.000923, 36.675807]
      },
      {
        name: '南京分行',
        center: [118.778074, 32.057236]
      },
      {
        name: '南昌分行',
        center: [115.892151, 28.676493]
      },
      {
        name: '宁波分行',
        center: [121.550357, 29.874557]
      },
      {
        name: '青岛分行',
        center: [120.382639, 36.067082]
      },
      {
        name: '绍兴分行',
        center: [120.582112, 29.997117]
      },
      {
        name: '太原分行',
        center: [112.550864, 37.890277]
      },
      {
        name: '温州分行',
        center: [120.672111, 28.000575]
      }
    ]
  },
  {
    name: '东北区域',
    center: [125.3245, 43.886841],
    children: [
      {
        name: '长春分行',
        center: [125.3245, 43.886841]
      },
      {
        name: '大连分行',
        center: [121.618622, 38.91459]
      },
      {
        name: '哈尔滨分行',
        center: [126.534967, 45.803775]
      },
      {
        name: '沈阳分行',
        center: [123.432791, 41.808645]
      }
    ]
  },
  {
    name: '华南区域',
    center: [113.280637, 23.125178],
    children: [
      {
        name: '南宁分行',
        center: [108.297234, 22.806493]
      },
      {
        name: '深圳分行',
        center: [114.057868, 22.543099]
      },
      {
        name: '广州分行',
        center: [113.30765, 23.120049]
      },
      {
        name: '厦门分行',
        center: [118.103886, 24.489231]
      },
      {
        name: '福州分行',
        center: [119.330221, 26.047125]
      },
      {
        name: '海口分行',
        center: [110.33119, 20.031971]
      }
    ]
  },
  {
    name: '华中区域',
    center: [114.298572, 30.584355],
    children: [
      {
        name: '长沙分行',
        center: [112.979353, 28.213478]
      },
      {
        name: '郑州分行',
        center: [113.649644, 34.75661]
      },
      {
        name: '武汉分行',
        center: [114.298572, 30.584355]
      }
    ]
  },
  {
    name: '华北区域',
    center: [117.210813, 39.14393],
    children: [
      {
        name: '北京分行',
        center: [116.397428, 39.90923]
      },
      {
        name: '天津分行',
        center: [117.200983, 39.084158]
      },
      {
        name: '呼和浩特分行',
        center: [111.670801, 40.818311]
      },
      {
        name: '理财公司',
        center: [116.341395, 39.728932]
      },
      {
        name: '石家庄分行',
        center: [114.502461, 38.045474]
      },
      {
        name: '租赁公司',
        center: [116.235906, 40.218085]
      }
    ]
  },
  {
    name: '西北区域',
    center: [101.778916, 36.623178],
    children: [
      {
        name: '乌鲁木齐分行',
        center: [87.616848, 43.792818]
      },
      {
        name: '西安分行',
        center: [108.940175, 34.341568]
      },
      {
        name: '兰州分行',
        center: [103.823557, 36.064226]
      },
      {
        name: '西宁分行',
        center: [101.778916, 36.623178]
      },
      {
        name: '银川分行',
        center: [106.278179, 38.46637]
      }
    ]
  },
  {
    name: '西南区域',
    center: [104.065735, 30.659462],
    children: [
      {
        name: '成都分行',
        center: [104.067923, 30.679943]
      },
      {
        name: '重庆分行',
        center: [106.530635, 29.544606]
      },
      {
        name: '昆明分行',
        center: [102.712251, 25.040609]
      },
      {
        name: '村镇分行',
        center: [102.832891, 24.880095]
      },
      {
        name: '贵阳分行',
        center: [106.713478, 26.578343]
      }
    ]
  }


]